jmeter/PokemonV1/load/tmp/effective.yml
---
baseUrl: null
cli:
  linter:
    disable: false
    ignored-warnings: []
    lint-and-exit: false
    warn-on-unfamiliar-fields: false
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  func:
    modules:
      console:
        disable: true
    settings:
      aggregator: functional-consolidator
  gui:
    modules:
      jmeter:
        gui: true
  install-tools:
    services:
    - install-checker
  lint:
    cli:
      linter:
        lint-and-exit: true
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  nolint:
    cli:
      linter:
        disable: true
  public:
    modules:
      blazemeter:
        public-report: true
  report:
    reporting:
    - blazemeter
  sequential:
    modules:
      local:
        sequential: true
execution:
- concurrency: {}
  executor: jmeter
  scenario: smoke
  throughput: {}
included-configs: []
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  android-emulator:
    class: bzt.modules.services.AndroidEmulatorLoader
  apiritif:
    class: bzt.modules._apiritif.ApiritifNoseExecutor
  appium:
    class: bzt.modules.services.AppiumLoader
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
  capturehar:
    class: bzt.modules.blazemeter.ServiceStubCaptureHAR
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
  consolidator:
    class: bzt.modules.aggregator.ConsolidatingAggregator
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
  external-results-loader:
    class: bzt.modules.external.ExternalResultsLoader
  final-stats:
    class: bzt.modules.reporting.FinalStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  functional-consolidator:
    class: bzt.modules.functional.FunctionalAggregator
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  influxdb-reporter:
    class: bzt.modules.influxdb_reporter.InfluxdbStatusReporter
  install-checker:
    class: bzt.modules.services.InstallChecker
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    path: C:\Users\marcrp\.bzt\jmeter-taurus\5.4.3\bin\jmeter.bat
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      summariser.name: ''
    protocol-handlers:
      grpc: bzt.jmx.grpc.GRPCProtocolHandler
      http: bzt.jmx.http.HTTPProtocolHandler
      mqtt: bzt.jmx.mqtt.MQTTProtocolHandler
    version: 5.4.3
  junit:
    class: bzt.modules.java.JUnitTester
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  k6:
    class: bzt.modules.k6.K6Executor
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules._locustio.LocustIOExecutor
  mocha:
    class: bzt.modules.javascript.MochaTester
  molotov:
    class: bzt.modules._molotov.MolotovExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  newman:
    class: bzt.modules.javascript.NewmanExecutor
  nunit:
    class: bzt.modules.csharp.NUnitExecutor
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pip-install:
    class: bzt.modules.services.PipInstaller
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  pytest:
    class: bzt.modules._pytest.PyTestExecutor
  robot:
    class: bzt.modules.robot.RobotExecutor
  rspec:
    class: bzt.modules.ruby.RSpecTester
  screenshoter:
    class: bzt.modules.blazemeter.ServiceStubScreenshoter
  selenium:
    class: bzt.modules._selenium.SeleniumExecutor
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  testng:
    class: bzt.modules.java.TestNGTester
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
  virtual-display:
    class: bzt.modules.services.VirtualDisplay
  wdio:
    class: bzt.modules.javascript.WebdriverIOExecutor
  xunit:
    class: bzt.modules.csharp.XUnitExecutor
provisioning: local
reporting:
- module: final-stats
- module: console
- failed-labels: false
  module: final-stats
  percentiles: true
  summary: true
  test-duration: true
- module: blazemeter
  project: Taurus test project
  report-name: Taurus test report - Demo
  test: Taurus test
scenarios:
  load:
    script: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\testScript.jmx
    variables:
      ErrorsPath: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\Errors.csv
      Protocol: https
      RampUp: 0
      ResultsPath: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\Results.csv
      Rpm: 5
      TestDuration: 30
      Threads: 2
      Url: pokeapi.co
  smoke:
    script: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\testScript.jmx
    variables:
      ErrorsPath: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\Errors.csv
      Protocol: https
      RampUp: 0
      ResultsPath: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\Results.csv
      Rpm: 5
      TestDuration: 30
      Threads: 2
      Url: pokeapi.co
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
- module: shellexec
  post-process:
  - command: mkdir C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\default\HTML
  - command: jmeter -g C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon/load/default/Results.csv -o C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon/load/default/HTML
settings:
  aggregator: consolidator
  artifacts-dir: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\tmp
  default-executor: jmeter
  env:
    BASE_DIR: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon
    OBJC_DISABLE_INITIALIZE_FORK_SAFETY: 'YES'
    TAURUS_ARTIFACTS_DIR: C:\Users\marcrp\Documents\Vueling-University\jmeter\Pokemon\load\tmp
testName: null
version: 1.16.23